---
title: DuctSizeIterator
classe: Autodesk.Revit.DB.Mechanical.DuctSizeIterator
namespace: Autodesk.Revit.DB.Mechanical
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# DuctSizeIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `MEPSize Current { get; }` | `ductSizeIterator.Current` | MEPSize |
| `Boolean IsValidObject { get; }` | `ductSizeIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `ductSizeIterator.Dispose()` | Void |
| `MEPSize GetCurrent()` | `ductSizeIterator.GetCurrent()` | MEPSize |
| `Boolean HasCurrent()` | `ductSizeIterator.HasCurrent()` | Boolean |
| `Boolean IsDone()` | `ductSizeIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `ductSizeIterator.MoveNext()` | Boolean |
| `Void Reset()` | `ductSizeIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```